<a href="https://colab.research.google.com/github/silverstar0727/1day-1commit-challenge/blob/master/pandas_day4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Missing Data

## pandas day4
day1의 데이터를 가지고 진행합니다.

In [0]:
# day1의 데이터를 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

dates = pd.date_range('20100101', periods = 5)
df = pd.DataFrame(np.random.randn(5,4), index = dates, columns = list('ABCD'))

In [3]:
df

                   A         B         C         D
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993
2010-01-02  0.617005  0.767844 -2.477006 -1.483478
2010-01-03  0.525898  1.480172 -0.190536 -1.311518
2010-01-04  0.770338  0.552496  1.848935 -0.651645
2010-01-05 -1.276955 -0.419954  0.782022  0.374825

In [0]:
# reindex는 인덱스를 변경,추가,삭제할 수 있다
df1 = df.reindex(index=dates[0:4], columns = list(df.columns) + ['E'])

In [5]:
df1

                   A         B         C         D   E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993 NaN
2010-01-02  0.617005  0.767844 -2.477006 -1.483478 NaN
2010-01-03  0.525898  1.480172 -0.190536 -1.311518 NaN
2010-01-04  0.770338  0.552496  1.848935 -0.651645 NaN

In [0]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [8]:
df1

                   A         B         C         D    E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993  1.0
2010-01-02  0.617005  0.767844 -2.477006 -1.483478  1.0
2010-01-03  0.525898  1.480172 -0.190536 -1.311518  NaN
2010-01-04  0.770338  0.552496  1.848935 -0.651645  NaN

In [9]:
# np.nan에 해당하는 데이터를 지운다
df1.dropna(how = 'any')

                   A         B         C         D    E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993  1.0
2010-01-02  0.617005  0.767844 -2.477006 -1.483478  1.0

In [11]:
# 지운값을 반환하는거라서 df1은 그대로 나오는 것을 볼 수 있다.
df1

                   A         B         C         D    E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993  1.0
2010-01-02  0.617005  0.767844 -2.477006 -1.483478  1.0
2010-01-03  0.525898  1.480172 -0.190536 -1.311518  NaN
2010-01-04  0.770338  0.552496  1.848935 -0.651645  NaN

In [12]:
# nan에 주어진값(5)를 채워넣는다
df1.fillna(value = 5)

                   A         B         C         D    E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993  1.0
2010-01-02  0.617005  0.767844 -2.477006 -1.483478  1.0
2010-01-03  0.525898  1.480172 -0.190536 -1.311518  5.0
2010-01-04  0.770338  0.552496  1.848935 -0.651645  5.0

In [13]:
# dropna의 결과와 동일
df1

                   A         B         C         D    E
2010-01-01 -0.677234 -0.425903 -1.223405 -0.819993  1.0
2010-01-02  0.617005  0.767844 -2.477006 -1.483478  1.0
2010-01-03  0.525898  1.480172 -0.190536 -1.311518  NaN
2010-01-04  0.770338  0.552496  1.848935 -0.651645  NaN

In [14]:
# boolean데이터로 변환하고 True는 na값에 해당한다.
pd.isna(df1)

                A      B      C      D      E
2010-01-01  False  False  False  False  False
2010-01-02  False  False  False  False  False
2010-01-03  False  False  False  False   True
2010-01-04  False  False  False  False   True

# 쉬울수록 중요하다..
오늘건 생각보다 쉬웠다고 생각하는데, 쉬울수록 그 중요도는 높아지는 것 같다..

데이터가 누락되는 경우가 지난번에 프로젝트를 진행했을때 꽤나 많아서 그것을 지우기 위해서 이번에 배운 dropna를 유용하게 활용했기 때문